

// Описание
// 
// Параметры:
// 	Пользователь - ПользовательИнформационнойБазы - 
// Возвращаемое значение:
// 	- СправочникСсылка.Пользователи - 
Функция ПолучитьПользователя(Пользователь) Экспорт
	
	РезультатПоиска = НайтиПоНаименованию(Пользователь.Имя);
	
	Если (РезультатПоиска.Пустая()) Тогда
		НовыйПользователь = СоздатьЭлемент();
		НовыйПользователь.Наименование = Пользователь.Имя;
		НовыйПользователь.ПолноеИмяПользователя = Пользователь.ПолноеИмя;
		
		НовыйПользователь.ЗаполнитьТаблицуРолей();
		НовыйПользователь.Записать();
		
		РезультатПоиска = НовыйПользователь.Ссылка;		
	КонецЕсли;
	 
	 Возврат РезультатПоиска;
	
КонецФункции